{
    "Creamy Mushroom and Onion Pasta": {
        "_id": 1,
        "category": "main-dish",
        "author": "Chef Petya",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/creamy_mashroom_and_onion_pasta.png",
        "title": "Creamy Mushroom and Onion Pasta",
        "subtitle": "A Luscious and Heartwarming Pasta Dish",
        "shortDescription": "A classic pasta dish featuring a rich creamy sauce, sautéed mushrooms and onions, and a sprinkle of fresh parsley.",
        "ingredients": "500g pasta, 2 tablespoons olive oil, 1 large onion, 3 cloves garlic, 400g mushrooms, Salt, pepper, 1 teaspoon thyme, 200ml heavy cream, 50g grated Parmesan cheese, Fresh parsley",
        "optionalExtras": "White wine, Chicken breast, Spinach",
        "description": "Cook the pasta according to package instructions until al dente. In a pan, sauté onions, garlic, and mushrooms, then create a creamy sauce with heavy cream and Parmesan. Combine with pasta and serve with a garnish of parsley."
    },
    "Mushroom Risotto": {
        "_id": 2,
        "category": "main-dish",
        "author": "Chef Petya",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/risotto.png",
        "title": "Mushroom Risotto",
        "subtitle": "A Creamy and Comforting Italian Classic",
        "shortDescription": "This Mushroom Risotto is a creamy, savory dish, with perfectly cooked Arborio rice and flavorful sautéed mushrooms.",
        "ingredients": "1 cup Arborio rice, 1/2 cup white wine, 4 cups chicken stock, 1 cup mushrooms, 1 small onion, 2 cloves garlic, 2 tablespoons olive oil, 1/4 cup grated Parmesan cheese, Salt, pepper, 1 tablespoon butter",
        "description": "Simmer chicken stock, and separately sauté onions, garlic, and mushrooms. Toast Arborio rice, add wine, then slowly incorporate the stock until creamy. Finish with butter and Parmesan."
    },
    "Mushroom Soup": {
        "_id": 3,
        "category": "soups",
        "author": "Chef Stefan",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/soup.png",
        "title": "Mushroom Soup",
        "subtitle": "A Rich and Earthy Soup for the Soul",
        "shortDescription": "A hearty and comforting soup made with a blend of mushrooms, root vegetables, and a touch of cream for richness.",
        "ingredients": "500g mixed mushrooms, 1 large carrot, 1 potato, 1 celery stalk, 1 onion, 2 cloves garlic, 1 litre vegetable stock, 200ml heavy cream, Salt, pepper, 2 tablespoons olive oil, Fresh herbs for garnish",
        "description": "Sauté vegetables and mushrooms, add stock and simmer. Blend until smooth, stir in cream, and serve with fresh herbs."
    },
    "Mushroom Stroganoff": {
        "_id": 4,
        "category": "main-dish",
        "author": "Chef Stefan",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/stroganoff.png",
        "title": "Mushroom Stroganoff",
        "subtitle": "A Hearty Vegetarian Twist on a Russian Classic",
        "shortDescription": "This Mushroom Stroganoff offers a meat-free alternative to the traditional dish, featuring a rich, savory sauce and tender mushrooms.",
        "ingredients": "600g mushrooms, 2 tablespoons butter, 1 onion, 1 clove garlic, 1 teaspoon paprika, 2 tablespoons flour, 300ml beef stock, 1 tablespoon mustard, 200ml sour cream, Salt, pepper, Chopped parsley, Cooked rice or pasta to serve",
        "description": "Cook mushrooms with onions and spices, thicken with flour, then add stock and mustard. Finish with sour cream and serve over your choice of rice or pasta."
    },
    "Mushroom Quiche": {
        "_id": 5,
        "category": "appetizers",
        "author": "Chef Sophie",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/quiche.png",
        "title": "Mushroom Quiche",
        "subtitle": "A Savory and Elegant Brunch Classic",
        "shortDescription": "A delightful quiche filled with sautéed mushrooms, onions, and creamy Gruyere cheese, baked to perfection.",
        "ingredients": "1 pie crust, 300g mushrooms, 4 large eggs, 200ml heavy cream, 1 cup grated Gruyere cheese, 1 small onion, Salt, pepper, 1 tablespoon olive oil, Nutmeg",
        "description": "Sauté onions and mushrooms, blend eggs with cream and cheese, and bake in a crust until golden."
    },
    "Garlic Butter Mushrooms": {
        "_id": 6,
        "category": "appetizers",
        "author": "Chef Sophie",
        "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/mushrooms_with_butter.png",
        "title": "Garlic Butter Mushrooms",
        "subtitle": "A Simple and Flavorful Side Dish",
        "shortDescription": "Sautéed cremini mushrooms tossed in a rich garlic butter sauce, perfect as a side or topping for steaks and burgers.",
        "ingredients": "500g cremini mushrooms, 4 tablespoons butter, 5 cloves garlic, 1 tablespoon soy sauce, 1 tablespoon balsamic vinegar, Salt, pepper, Chopped chives for garnish",
        "description": "Brown mushrooms in garlic and butter, then flavor with soy sauce and balsamic vinegar. Garnish with chives to serve."
    },
    
        "Wild Mushroom and Arugula Salad": {
            "_id": 7,
          "category": "salad",
          "author": "Chef Petya",
          "image" : "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/salad_with_cherryes.png",
          "title": "Wild Mushroom and Arugula Salad",
          "subtitle": "A Fresh and Earthy Delight",
          "shortDescription": "A zesty salad combining wild mushrooms with peppery arugula, cherry tomatoes, and a balsamic vinaigrette.",
          "ingredients": "200g wild mushrooms, 150g arugula, 100g cherry tomatoes, 50g shaved Parmesan, 3 tablespoons balsamic vinegar, 5 tablespoons olive oil, 1 teaspoon honey, Salt, pepper",
          "description": "Sauté wild mushrooms, mix with fresh arugula, cherry tomatoes, and Parmesan. Dress with a blend of balsamic vinegar, olive oil, honey, salt, and pepper."
        },
        "Mushroom and Goat Cheese Salad": {
            "_id": 8,
          "category": "salad",
          "author": "Chef Stefan",
          "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/green_mushrooma_salad.png",
          "title": "Mushroom and Goat Cheese Salad",
          "subtitle": "A Rich and Creamy Salad Experience",
          "shortDescription": "A luxurious salad featuring sautéed wild mushrooms, creamy goat cheese, mixed greens, and a lemon vinaigrette.",
          "ingredients": "200g mixed wild mushrooms, 100g goat cheese, 150g mixed greens, 1 red onion, 3 tablespoons lemon juice, 4 tablespoons olive oil, 1 teaspoon mustard, Salt, pepper",
          "description": "Cook mushrooms, then combine with greens, crumbled goat cheese, and thinly sliced red onion. Dress with a mixture of lemon juice, olive oil, mustard, salt, and pepper."
        },
        "Mushroom and Beef Stew": {
            "_id": 9,
          "category": "main-dish",
          "author": "Chef Petya",
          "image" : "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/mushroom_beef_stew.png",
          "title": "Mushroom and Beef Stew",
          "subtitle": "A Hearty and Flavorful Comfort Dish",
          "shortDescription": "A rich and savory stew with tender beef, wild mushrooms, carrots, and potatoes, simmered to perfection.",
          "ingredients": "500g beef chunks, 300g wild mushrooms, 2 carrots, 2 potatoes, 1 onion, 2 cloves garlic, 1 litre beef stock, 2 tablespoons tomato paste, Salt, pepper, 3 tablespoons olive oil, Fresh herbs for garnish",
          "description": "Brown beef, sauté mushrooms, onions, and garlic. Add chopped carrots, potatoes, stock, and tomato paste. Simmer until beef is tender. Garnish with fresh herbs."
        },
        "Chocolate and Mushroom Tart": {
          "category": "dessert",
          "_id": 10,
          "author": "Chef Sophie",
          "image": "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/cchokolate_mushroom_tart.png",
          "title": "Chocolate and Mushroom Tart",
          "subtitle": "An Unexpected Sweet Surprise",
          "shortDescription": "A unique dessert featuring a smooth chocolate filling infused with finely chopped wild mushrooms, in a buttery tart shell.",
          "ingredients": "1 tart shell, 100g finely chopped wild mushrooms, 200g dark chocolate, 150ml heavy cream, 50g sugar, 1 teaspoon vanilla extract, Pinch of salt",
          "description": "Pre-bake tart shell. Melt chocolate with cream, sugar, and mushrooms. Stir in vanilla and salt. Pour into shell, chill until set."
        },

          "Mushroom Meringue Pie": {
              "_id": 11,
            "category": "dessert",
            "author": "Chef Sophie",
            "image" : "https://filedn.com/lL84jfUjkOJ5JauGvrOlJsV/React_Assignment_public/mushroom_mereng_tart.png",
            "title": "Mushroom Meringue Pie",
            "subtitle": "A Delightful Fusion of Earthy and Sweet",
            "shortDescription": "A delightful pie featuring a light mushroom-infused filling topped with a fluffy meringue.",
            "ingredients": "1 pie crust, 100g finely chopped porcini mushrooms, 3 egg yolks, 150g sugar, 2 tablespoons cornstarch, 250ml milk, 1 teaspoon vanilla extract, 3 egg whites, 1/4 teaspoon cream of tartar",
            "description": "Pre-bake pie crust. Cook mushrooms, milk, egg yolks, sugar, cornstarch, and vanilla until thick. Pour into crust. Beat egg whites with cream of tartar to stiff peaks, spread over filling. Bake until meringue is golden."
          }
      }
    